# Title
By Steven & Allison

Mod 1 Project: Draft

### Table of Contents###

1. <a href='TheProblemStatement'>The Problem Statement </a>
2. <a href='sources'>Data Sources</a>
  
  2a. <a href='first'>First Dataset</a>
  
  2b. <a href='second'>Second Dataset</a>

3. <a href ='clean'>Data Cleaning</a>
4. <a href = 'merging'>Merging the Datasets</a>

<a id='TheProblemStatement'></a>
### The Problem Statement###

**Which Types of Studios are Associated with Successful Films?**

Our main aim for this analysis was to inform Microsoft's approach to the movie industry. As a first step, we sought to understand which types of studios were associated with successful films. 

We define "successful" films using the metric of return on investment (ROI). We calculate ROI as gross sales less production budget. We selected ROI because it is a monetary measure--which captures the profit-seeking motive behind Microsoft's entry into the movie industry--and also because ROI accounts for the effects of inflation.

##### Import Libraries

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

<a id='sources'></a>
### Data Sources

Our primary data source is from TheNumbers.com and contains information on release dates, domestic and worldwide gross income, and production budgets. This dataset has information on nearly 6,000 movies. 

Our secondary data source is from Box Office Mojo and contains information on year of release, domestic and foreign sales, and studios. This dataset contains information on over 3,000 movies released from 2010 through 2018. 

We used the information in the first dataset to calculate two metrics: ROI and net revenue. We used the data on studios from the second dataset.

<a id='first'></a>
#### First Dataset ####

In [15]:
movies_df = pd.read_csv('./data/tn.movie_budgets.csv.gz') #read in datafile

In [16]:
movies_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [10]:
movies_df.tail()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [6]:
movies_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
id                   5782 non-null int64
release_date         5782 non-null object
movie                5782 non-null object
production_budget    5782 non-null object
domestic_gross       5782 non-null object
worldwide_gross      5782 non-null object
dtypes: int64(1), object(5)
memory usage: 271.1+ KB

In [7]:
movies_df.shape

(5782, 6)

<a id= 'second'></a>
#### Second Dataset####

In [14]:
studio_df = pd.read_csv('./data/bom.movie_gross.csv.gz')
studio_df.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [36]:
studio_df.shape

(3387, 5)

In [35]:
# Clean up this dataset - keep domestic and foreign in case helps add to missing data in other set. 
studio_df.isna().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [37]:
studio_df[studio_df['title'].duplicated()]

          title studio  domestic_gross foreign_gross  year
3045  Bluebeard  WGUSA         43100.0           NaN  2017

In [38]:
studio_df[studio_df['title'] == 'Bluebeard'] #these aren't actually duplicates

          title  studio  domestic_gross foreign_gross  year
317   Bluebeard  Strand         33500.0          5200  2010
3045  Bluebeard   WGUSA         43100.0           NaN  2017

<a id = 'clean' ></a>
### Data Cleaning

We followed the following steps to clean the datasets:
 - Check for null values
 - Check for duplicate values
 - Change 'release_date' to a date-time object
 - Change monetary figures from strings to integers

In [7]:
movies_df.isna().sum()

id                   0
release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

The dataframe did not appear to contain any explicitly null values.

In [1]:
movies_df[movies_df.duplicated(subset = 'id')].head()

NameError: name 'movies_df' is not defined

In [9]:
# drop id column
movies_df = movies_df.drop(columns = 'id')

Change release_date to datetime object

In [10]:
movies_df['release_date'] = pd.to_datetime(movies_df['release_date'])

In [11]:
# Sort by datetime
movies_df.sort_values(by='release_date').tail(39)

,release_date,movie,production_budget,domestic_gross,worldwide_gross
5037,2019-04-23,Living Dark: The Story of Ted the Caver,"$1,750,000",$0,$0
1305,2019-05-03,UglyDolls,"$45,000,000","$19,894,664","$24,644,664"
3915,2019-05-03,El Chicano,"$8,000,000","$700,261","$700,261"
3871,2019-05-03,The Intruder,"$8,000,000","$35,095,904","$36,005,871"
1474,2019-05-03,Long Shot,"$40,000,000","$30,202,860","$43,711,031"
2325,2019-05-10,The Professor and the Madman,"$25,000,000",$0,"$5,227,233"
175,2019-05-10,PokÃ©mon: Detective Pikachu,"$150,000,000","$139,507,806","$411,258,433"
3795,2019-05-17,The Sun is Also a Star,"$9,000,000","$4,950,029","$5,434,029"
1380,2019-05-17,John Wick: Chapter 3 â Parabellum,"$40,000,000","$141,744,320","$256,498,033"
80,2019-05-24,Aladdin,"$182,000,000","$246,734,314","$619,234,314"
4012,2019-05-24,BrightBurn,"$7,000,000","$16,794,432","$27,989,498"
124,2019-05-31,Godzilla: King of the Monsters,"$170,000,000","$85,576,941","$299,276,941"
4265,2019-05-31,MA,"$5,000,000","$36,049,540","$44,300,625"
1370,2019-05-31,Rocketman,"$41,000,000","$57,342,725","$108,642,725"
580,2019-06-07,The Secret Life of Pets 2,"$80,000,000","$63,795,655","$113,351,496"
2,2019-06-07,Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
4534,2019-06-07,Late Night,"$4,000,000","$246,305","$246,305"
1997,2019-06-14,Shaft,"$30,000,000","$600,000","$600,000"
341,2019-06-14,Men in Black: International,"$110,000,000","$3,100,000","$3,100,000"
1538,2019-06-21,Kursk,"$40,000,000",$0,"$4,212,799"
3947,2019-06-21,Burn Your Maps,"$8,000,000",$0,$0
2915,2019-07-12,Crawl,"$17,000,000",$0,$0
3163,2019-08-14,Blinded by the Light,"$15,000,000",$0,$0
670,2019-08-30,PLAYMOBIL,"$75,000,000",$0,$0
1542,2019-09-13,The Goldfinch,"$40,000,000",$0,$0
1208,2019-09-20,Ad Astra,"$49,800,000",$0,$0
2029,2019-09-30,Unhinged,"$29,000,000",$0,$0
952,2019-11-08,Midway,"$59,500,000",$0,$0
1206,2019-11-08,Arctic Dogs,"$50,000,000",$0,$0
1207,2019-11-22,The Rhythm Section,"$50,000,000",$0,$0
480,2019-12-31,Army of the Dead,"$90,000,000",$0,$0
3515,2019-12-31,Eli,"$11,000,000",$0,$0
671,2019-12-31,355,"$75,000,000",$0,$0
1543,2019-12-31,Down Under Cover,"$40,000,000",$0,$0
2329,2019-12-31,Reagan,"$25,000,000",$0,$0
3312,2019-12-31,Rogue City,"$13,000,000",$0,$0
535,2020-02-21,Call of the Wild,"$82,000,000",$0,$0
1205,2020-12-31,Hannibal the Conqueror,"$50,000,000",$0,$0
194,2020-12-31,Moonfall,"$150,000,000",$0,$0

In [12]:
# sort movies by release date
movies_df = movies_df.sort_values(by = 'release_date')

In [13]:
movies_df.reset_index()

,index,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,5677,1915-02-08,The Birth of a Nation,"$110,000","$10,000,000","$11,000,000"
1,5523,1916-09-05,Intolerance,"$385,907",$0,$0
2,5614,1916-12-24,"20,000 Leagues Under the Sea","$200,000","$8,000,000","$8,000,000"
3,5683,1920-09-17,Over the Hill to the Poorhouse,"$100,000","$3,000,000","$3,000,000"
4,5606,1925-11-19,The Big Parade,"$245,000","$11,000,000","$22,000,000"
5,4569,1925-12-30,Ben-Hur: A Tale of the Christ,"$3,900,000","$9,000,000","$9,000,000"
6,4984,1927-08-12,Wings,"$2,000,000",$0,$0
7,5524,1929-02-01,The Broadway Melody,"$379,000","$2,800,000","$4,358,000"
8,4559,1930-11-15,Hell's Angels,"$4,000,000",$0,$0
9,5423,1931-12-26,Mata Hari,"$558,000","$900,000","$900,000"
10,5618,1933-02-09,She Done Him Wrong,"$200,000","$2,000,000","$2,000,000"
11,5502,1933-03-09,42nd Street,"$439,000","$1,438,000","$2,281,000"
12,5396,1933-04-07,King Kong,"$672,000","$10,000,000","$10,000,650"
13,5537,1934-02-22,It Happened One Night,"$325,000","$2,500,000","$2,500,000"
14,5405,1935-09-06,Top Hat,"$609,000","$1,782,000","$3,202,000"
15,5097,1936-02-05,Modern Times,"$1,500,000","$163,245","$199,747"
16,5131,1936-06-26,San Francisco,"$1,300,000","$2,868,000","$5,273,000"
17,5180,1936-10-20,The Charge of the Light Brigade,"$1,200,000",$0,$0
18,5117,1937-12-21,Snow White and the Seven Dwarfs,"$1,488,000","$184,925,486","$184,925,486"
19,4917,1938-05-24,Alexander's Ragtime Band,"$2,000,000","$4,000,000","$4,000,000"
20,5049,1938-09-01,You Can't Take It With You,"$1,644,000","$4,000,000","$4,000,000"
21,4788,1939-08-25,The Wizard of Oz,"$2,777,000","$34,063,405","$34,305,476"
22,5068,1939-10-17,Mr. Smith Goes To Washington,"$1,500,000","$9,000,000","$9,000,000"
23,4567,1939-12-15,Gone with the Wind,"$3,900,000","$198,680,470","$390,525,192"
24,4867,1940-02-09,Pinocchio,"$2,289,247","$84,300,000","$84,300,000"
25,5146,1940-03-21,Rebecca,"$1,288,000","$6,000,000","$6,002,370"
26,4901,1940-08-30,Boom Town,"$2,000,000","$9,172,000","$9,172,000"
27,4868,1940-11-13,Fantasia,"$2,280,000","$83,320,000","$83,320,000"
28,5154,1941-10-28,How Green Was My Valley,"$1,250,000",$0,$0
29,5346,1942-08-13,Bambi,"$858,000","$102,797,000","$268,000,000"
...,...,...,...,...,...,...
5752,80,2019-05-24,Aladdin,"$182,000,000","$246,734,314","$619,234,314"
5753,4012,2019-05-24,BrightBurn,"$7,000,000","$16,794,432","$27,989,498"
5754,124,2019-05-31,Godzilla: King of the Monsters,"$170,000,000","$85,576,941","$299,276,941"
5755,4265,2019-05-31,MA,"$5,000,000","$36,049,540","$44,300,625"
5756,1370,2019-05-31,Rocketman,"$41,000,000","$57,342,725","$108,642,725"
5757,580,2019-06-07,The Secret Life of Pets 2,"$80,000,000","$63,795,655","$113,351,496"
5758,2,2019-06-07,Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
5759,4534,2019-06-07,Late Night,"$4,000,000","$246,305","$246,305"
5760,1997,2019-06-14,Shaft,"$30,000,000","$600,000","$600,000"
5761,341,2019-06-14,Men in Black: International,"$110,000,000","$3,100,000","$3,100,000"
5762,1538,2019-06-21,Kursk,"$40,000,000",$0,"$4,212,799"
5763,3947,2019-06-21,Burn Your Maps,"$8,000,000",$0,$0
5764,2915,2019-07-12,Crawl,"$17,000,000",$0,$0
5765,3163,2019-08-14,Blinded by the Light,"$15,000,000",$0,$0
5766,670,2019-08-30,PLAYMOBIL,"$75,000,000",$0,$0
5767,1542,2019-09-13,The Goldfinch,"$40,000,000",$0,$0
5768,1208,2019-09-20,Ad Astra,"$49,800,000",$0,$0
5769,2029,2019-09-30,Unhinged,"$29,000,000",$0,$0
5770,952,2019-11-08,Midway,"$59,500,000",$0,$0
5771,1206,2019-11-08,Arctic Dogs,"$50,000,000",$0,$0
5772,1207,2019-11-22,The Rhythm Section,"$50,000,000",$0,$0
5773,480,2019-12-31,Army of the Dead,"$90,000,000",$0,$0
5774,3515,2019-12-31,Eli,"$11,000,000",$0,$0
5775,671,2019-12-31,355,"$75,000,000",$0,$0
5776,1543,2019-12-31,Down Under Cover,"$40,000,000",$0,$0
5777,2329,2019-12-31,Reagan,"$25,000,000",$0,$0
5778,3312,2019-12-31,Rogue City,"$13,000,000",$0,$0
5779,535,2020-02-21,Call of the Wild,"$82,000,000",$0,$0
5780,1205,2020-12-31,Hannibal the Conqueror,"$50,000,000",$0,$0
5781,194,2020-12-31,Moonfall,"$150,000,000",$0,$0

In [14]:
movies_df = movies_df.drop(movies_df.tail(39).index)

In [15]:
movies_df.tail()

,release_date,movie,production_budget,domestic_gross,worldwide_gross
4132,2019-03-29,Unplanned,"$6,000,000","$18,107,621","$18,107,621"
496,2019-04-05,Shazam!,"$85,000,000","$139,606,856","$362,899,733"
2460,2019-04-05,Pet Sematary,"$21,000,000","$54,724,696","$109,501,146"
3633,2019-04-05,The Best of Enemies,"$10,000,000","$10,205,616","$10,205,616"
1176,2019-04-12,Hellboy,"$50,000,000","$21,903,748","$40,725,492"

In [16]:
movies_df[movies_df['worldwide_gross']=='$0']

,release_date,movie,production_budget,domestic_gross,worldwide_gross
5523,1916-09-05,Intolerance,"$385,907",$0,$0
4984,1927-08-12,Wings,"$2,000,000",$0,$0
4559,1930-11-15,Hell's Angels,"$4,000,000",$0,$0
5180,1936-10-20,The Charge of the Light Brigade,"$1,200,000",$0,$0
5154,1941-10-28,How Green Was My Valley,"$1,250,000",$0,$0
4759,1951-07-28,Alice in Wonderland,"$3,000,000",$0,$0
5061,1955-08-05,The Kingâs Thief,"$1,577,000",$0,$0
4797,1956-01-12,Diane,"$2,660,000",$0,$0
5535,1957-04-13,12 Angry Men,"$340,000",$0,$0
5713,1962-08-10,The Brain That Wouldn't Die,"$60,000",$0,$0
5128,1966-07-06,Batman - The Movie,"$1,377,800",$0,$0
4993,1966-10-16,A Funny Thing Happened on the Way to the Forum,"$2,000,000",$0,$0
4768,1967-09-18,Point Blank,"$3,000,000",$0,$0
3821,1968-10-10,Barbarella,"$9,000,000",$0,$0
2327,1970-01-01,Waterloo,"$25,000,000",$0,$0
4980,1971-04-28,Bananas,"$2,000,000",$0,$0
4558,1972-11-09,1776,"$4,000,000",$0,$0
4575,1974-12-31,The Taking of Pelham One Two Three,"$3,800,000",$0,$0
5559,1975-04-01,Death Race 2000,"$300,000",$0,$0
2914,1977-10-21,Damnation Alley,"$17,000,000",$0,$0
5491,1984-12-31,The Toxic Avenger,"$475,000",$0,$0
5520,1986-04-01,My Beautiful Laundrette,"$400,000",$0,$0
4866,1987-06-19,The Brave Little Toaster,"$2,300,000",$0,$0
5484,1990-12-31,Going Under,"$500,000",$0,$0
4191,1995-12-19,Men of War,"$6,000,000",$0,$0
3162,2001-06-29,Pandaemonium,"$15,000,000",$0,$0
4992,2001-12-31,Pendulum,"$2,000,000",$0,$0
5416,2002-08-23,Crop Circles: Quest for Truth,"$600,000",$0,$0
5749,2003-06-13,Manito,"$25,000",$0,$0
5305,2003-10-24,The Party's Over,"$1,000,000",$0,$0
...,...,...,...,...,...
5489,2015-12-31,Rodeo Girl,"$500,000",$0,$0
4772,2015-12-31,Unnatural,"$3,000,000",$0,$0
4563,2015-12-31,The Veil,"$4,000,000",$0,$0
4998,2015-12-31,Wind Walkers,"$2,000,000",$0,$0
4764,2015-12-31,AWOL-72,"$3,000,000",$0,$0
5385,2016-01-05,Adulterers,"$750,000",$0,$0
4865,2016-01-19,Eden,"$2,300,000",$0,$0
4885,2016-01-19,Sharkskin,"$2,100,000",$0,$0
4849,2016-02-02,The Rise of the Krays,"$2,500,000",$0,$0
2853,2016-02-19,Forsaken,"$18,000,000",$0,$0
5322,2016-03-01,1982,"$1,000,000",$0,$0
2754,2016-03-08,Out of the Inferno,"$19,000,000",$0,$0
4398,2016-03-15,The Hatching,"$5,000,000",$0,$0
5321,2016-04-08,Hush,"$1,000,000",$0,$0
3946,2016-05-06,Code of Honor,"$8,000,000",$0,$0
5675,2016-05-24,Une Femme MariÃ©e,"$120,000",$0,$0
4999,2016-07-08,The Dog Lover,"$2,000,000",$0,$0
2714,2016-07-22,Fight Valley,"$20,000,000",$0,$0
4848,2016-09-02,Antibirth,"$2,500,000",$0,$0
5324,2016-12-31,Chemical Cut,"$1,000,000",$0,$0
5645,2017-06-16,Arrowhead,"$180,000",$0,$0
4846,2017-09-01,Sky Sharks,"$2,500,000",$0,$0
4458,2017-12-01,Daisy Winters,"$4,500,000",$0,$0
479,2017-12-13,Bright,"$90,000,000",$0,$0
2715,2017-12-31,The Thousand Miles,"$20,000,000",$0,$0
5188,2017-12-31,The Islands,"$1,200,000",$0,$0
2716,2018-12-13,Bird Box,"$19,800,000",$0,$0
1541,2018-12-31,The Crow,"$40,000,000",$0,$0
5777,2018-12-31,Red 11,"$7,000",$0,$0
2481,2019-02-01,Velvet Buzzsaw,"$21,000,000",$0,$0

Change str obj to integers

In [18]:
movies_df['production_budget'] = movies_df['production_budget'].str.replace(',','')
movies_df['production_budget'] = movies_df['production_budget'].str.replace('$', '')
movies_df.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross
5677,1915-02-08,The Birth of a Nation,110000,"$10,000,000","$11,000,000"
5523,1916-09-05,Intolerance,385907,$0,$0
5614,1916-12-24,"20,000 Leagues Under the Sea",200000,"$8,000,000","$8,000,000"
5683,1920-09-17,Over the Hill to the Poorhouse,100000,"$3,000,000","$3,000,000"
5606,1925-11-19,The Big Parade,245000,"$11,000,000","$22,000,000"

In [19]:
movies_df['domestic_gross'] = movies_df['domestic_gross'].str.replace(',','')
movies_df['domestic_gross'] = movies_df['domestic_gross'].str.replace('$', '')
movies_df.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross
5677,1915-02-08,The Birth of a Nation,110000,10000000,"$11,000,000"
5523,1916-09-05,Intolerance,385907,0,$0
5614,1916-12-24,"20,000 Leagues Under the Sea",200000,8000000,"$8,000,000"
5683,1920-09-17,Over the Hill to the Poorhouse,100000,3000000,"$3,000,000"
5606,1925-11-19,The Big Parade,245000,11000000,"$22,000,000"

In [20]:
movies_df['worldwide_gross'] = movies_df['worldwide_gross'].str.replace(',','')
movies_df['worldwide_gross'] = movies_df['worldwide_gross'].str.replace('$', '')
movies_df.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross
5677,1915-02-08,The Birth of a Nation,110000,10000000,11000000
5523,1916-09-05,Intolerance,385907,0,0
5614,1916-12-24,"20,000 Leagues Under the Sea",200000,8000000,8000000
5683,1920-09-17,Over the Hill to the Poorhouse,100000,3000000,3000000
5606,1925-11-19,The Big Parade,245000,11000000,22000000

In [21]:
movies_df['production_budget'] = movies_df['production_budget'].astype(int)

In [22]:
movies_df['worldwide_gross'] = movies_df['worldwide_gross'].astype('int64')

In [23]:
movies_df['domestic_gross'] = movies_df['domestic_gross'].astype(int)

In [24]:
movies_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5743 entries, 5677 to 1176
Data columns (total 5 columns):
release_date         5743 non-null datetime64[ns]
movie                5743 non-null object
production_budget    5743 non-null int32
domestic_gross       5743 non-null int32
worldwide_gross      5743 non-null int64
dtypes: datetime64[ns](1), int32(2), int64(1), object(1)
memory usage: 224.3+ KB

In [25]:
# Check assumption that domestic figures are included in worldwide
movies_df[(movies_df['domestic_gross'] > movies_df['worldwide_gross'])]

Empty DataFrame
Columns: [release_date, movie, production_budget, domestic_gross, worldwide_gross]
Index: []

**Assumption: Domestic Gross is included in Worldwide Gross figures**

In [26]:
#Make an ROI column

In [27]:
movies_df['roi'] = movies_df['worldwide_gross'] / movies_df['production_budget']

In [28]:
movies_df.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross,roi
5677,1915-02-08,The Birth of a Nation,110000,10000000,11000000,100.000000
5523,1916-09-05,Intolerance,385907,0,0,0.000000
5614,1916-12-24,"20,000 Leagues Under the Sea",200000,8000000,8000000,40.000000
5683,1920-09-17,Over the Hill to the Poorhouse,100000,3000000,3000000,30.000000
5606,1925-11-19,The Big Parade,245000,11000000,22000000,89.795918

In [29]:
movies_df = movies_df.sort_values(by = 'roi', ascending = False)

In [30]:
movies_df.reset_index()

,index,release_date,movie,production_budget,domestic_gross,worldwide_gross,roi
0,5745,1972-06-30,Deep Throat,25000,45000000,45000000,1800.000000
1,5613,1980-03-21,Mad Max,200000,8750000,99750000,498.750000
2,5492,2009-09-25,Paranormal Activity,450000,107918810,194183034,431.517853
3,5679,2015-07-10,The Gallows,100000,22764410,41656474,416.564740
4,5406,1999-07-14,The Blair Witch Project,600000,140539099,248300000,413.833333
5,5709,2004-05-07,Super Size Me,65000,11529368,22233808,342.058585
6,5346,1942-08-13,Bambi,858000,102797000,268000000,312.354312
7,5773,1993-02-26,El Mariachi,7000,2040920,2041928,291.704000
8,5676,1968-10-01,Night of the Living Dead,114000,12087064,30087064,263.921614
9,5210,1976-11-21,Rocky,1000000,117235147,225000000,225.000000
10,5536,1978-10-17,Halloween,325000,47000000,70000000,215.384615
11,5715,1995-08-09,The Brothers McMullen,50000,10426506,10426506,208.530120
12,5665,1974-10-18,The Texas Chainsaw Massacre,140000,26572439,26572439,189.803136
13,5372,1973-08-11,American Graffiti,777000,115000000,140000000,180.180180
14,5781,2005-08-05,My Date With Drew,1100,181041,181041,164.582727
15,5656,2007-05-16,Once,150000,9445857,23323631,155.490873
16,5742,1994-10-19,Clerks,27000,3073428,3894240,144.231111
17,5612,1969-07-25,The Stewardesses,200000,13500000,25000000,125.000000
18,5117,1937-12-21,Snow White and the Seven Dwarfs,1488000,184925486,184925486,124.277880
19,5357,1971-01-01,Billy Jack,800000,98000000,98000000,122.500000
20,5774,2004-10-08,Primer,7000,424760,841926,120.275143
21,5746,1997-08-01,In the Company of Men,25000,2883661,2883661,115.346440
22,5507,2004-06-11,Napoleon Dynamite,400000,44540956,46122713,115.306782
23,5430,2004-08-06,Open Water,500000,30500882,55518641,111.037282
24,5424,1980-05-09,Friday the 13th,550000,39754601,59754601,108.644729
25,5680,2006-09-29,Facing the Giants,100000,10178331,10243159,102.431590
26,5211,2012-01-06,The Devil Inside,1000000,53262945,101759490,101.759490
27,5655,1971-01-01,Sweet Sweetback's Baad Asssss Song,150000,15200000,15200000,101.333333
28,4567,1939-12-15,Gone with the Wind,3900000,198680470,390525192,100.134665
29,5677,1915-02-08,The Birth of a Nation,110000,10000000,11000000,100.000000
...,...,...,...,...,...,...,...
5713,5324,2016-12-31,Chemical Cut,1000000,0,0,0.000000
5714,5480,2015-02-10,Love in the Time of Monsters,500000,0,0,0.000000
5715,5318,2015-02-10,Fear Clinic,1000000,0,0,0.000000
5716,5113,2015-02-13,Girlhouse,1500000,0,0,0.000000
5717,5344,2014-12-31,40 Weeks,900000,0,0,0.000000
5718,5735,2014-12-31,Happy 40th,35000,0,0,0.000000
5719,5127,2014-12-31,House at the End of the Drive,1400000,0,0,0.000000
5720,5418,2014-12-31,Light from the Darkroom,600000,0,0,0.000000
5721,5185,2014-09-09,Cotton Comes to Harlem,1200000,0,0,0.000000
5722,2011,2003-12-31,Ripley's Game,30000000,0,0,0.000000
5723,5637,2014-09-12,Archaeology of a Woman,200000,0,0,0.000000
5724,5754,2003-12-31,Flywheel,20000,0,0,0.000000
5725,5757,2003-12-01,Steel Spirit,20000,0,0,0.000000
5726,3453,2014-10-03,Drive Hard,12000000,0,0,0.000000
5727,5305,2003-10-24,The Party's Over,1000000,0,0,0.000000
5728,4769,2014-10-27,Iguana,3000000,0,0,0.000000
5729,4455,2014-11-07,Fugly,4500000,0,0,0.000000
5730,5112,2014-11-11,Once Upon a Time in Queens,1500000,0,0,0.000000
5731,4856,2014-11-14,Always Woodstock,2400000,0,0,0.000000
5732,4389,2014-11-21,Reach Me,5000000,0,0,0.000000
5733,5564,2010-12-31,Anderson's Cross,300000,0,0,0.000000
5734,5749,2003-06-13,Manito,25000,0,0,0.000000
5735,5126,2014-12-31,Kurmanjan datka,1400000,0,0,0.000000
5736,5522,2014-12-31,Pancakes,400000,0,0,0.000000
5737,5488,2014-12-31,The Sound and the Shadow,500000,0,0,0.000000
5738,5475,2014-12-31,America Is Still The Place,500000,0,0,0.000000
5739,5479,2014-12-31,Diamond Ruff,500000,0,0,0.000000
5740,5501,2014-12-31,Rise Of the Entrepreneur - The Search For A Be...,450000,0,0,0.000000
5741,4991,2014-12-31,Lucky Dog,2000000,0,0,0.000000
5742,5725,2014-12-31,The Image Revolution,50000,0,0,0.000000

In [31]:
movies_df.drop('domestic_gross', axis = 1, inplace = True)

In [32]:
movies_df.head()

,release_date,movie,production_budget,worldwide_gross,roi
5745,1972-06-30,Deep Throat,25000,45000000,1800.000000
5613,1980-03-21,Mad Max,200000,99750000,498.750000
5492,2009-09-25,Paranormal Activity,450000,194183034,431.517853
5679,2015-07-10,The Gallows,100000,41656474,416.564740
5406,1999-07-14,The Blair Witch Project,600000,248300000,413.833333

In [33]:
# Create a second feature
movies_df['net_revenue'] = movies_df['worldwide_gross'] - movies_df['production_budget']

<a id="expanding"> </a>
### Expanding the Dataset

In [34]:
# Find info on studio / producer
studio_df = pd.read_csv('./data/bom.movie_gross.csv.gz')
studio_df.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [35]:
# Clean up this dataset - keep domestic and foreign in case helps add to missing data in other set. 
studio_df.isna().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [36]:
studio_df.shape

(3387, 5)

In [37]:
studio_df[studio_df['title'].duplicated()]

          title studio  domestic_gross foreign_gross  year
3045  Bluebeard  WGUSA         43100.0           NaN  2017

In [38]:
studio_df[studio_df['title'] == 'Bluebeard'] #these aren't actually duplicates

          title  studio  domestic_gross foreign_gross  year
317   Bluebeard  Strand         33500.0          5200  2010
3045  Bluebeard   WGUSA         43100.0           NaN  2017

In [39]:
movies_df['year'] = movies_df['release_date'].dt.year

In [40]:
movies_df['year'] = movies_df['year'].astype(str)

In [41]:
# remane column so can merge
movies_df.rename(columns = {'movie': 'title'}, inplace = True)

In [42]:
# make new column in movies + year
movies_df['title_year'] = movies_df['title'] + ' ' + movies_df['year']

In [43]:
studio_df['year'] = studio_df['year'].astype(str)

In [44]:
studio_df['title_year'] = studio_df['title'] + ' ' + studio_df['year']

In [45]:
merged_df = movies_df.merge(studio_df, on = 'title_year', how = 'inner')

In [46]:
#One duplicate - which we deleted completely because no money.
merged_df[merged_df['title_year'].duplicated()]

Empty DataFrame
Columns: [release_date, title_x, production_budget, worldwide_gross, roi, net_revenue, year_x, title_year, title_y, studio, domestic_gross, foreign_gross, year_y]
Index: []

In [47]:
merged_df = merged_df[merged_df['title_year'] != 'Home 2009']

In [48]:
merged_df.head()

,release_date,title_x,production_budget,worldwide_gross,roi,net_revenue,year_x,title_year,title_y,studio,domestic_gross,foreign_gross,year_y
0,2015-07-10,The Gallows,100000,41656474,416.564740,41556474,2015,The Gallows 2015,The Gallows,WB (NL),22800000.0,20200000,2015
1,2012-01-06,The Devil Inside,1000000,101759490,101.759490,100759490,2012,The Devil Inside 2012,The Devil Inside,Par.,53300000.0,48500000,2012
2,2011-04-01,Insidious,1500000,99870886,66.580591,98370886,2011,Insidious 2011,Insidious,FD,54000000.0,43000000,2011
3,2015-04-17,Unfriended,1000000,64364198,64.364198,63364198,2015,Unfriended 2015,Unfriended,Uni.,32500000.0,31600000,2015
4,2010-10-20,Paranormal Activity 2,3000000,177512032,59.170677,174512032,2010,Paranormal Activity 2 2010,Paranormal Activity 2,Par.,84800000.0,92800000,2010

In [49]:
merged_df.shape

(1215, 13)

In [50]:
# No added info from studio dataset on $ numbers, so we will drop those columns
merged_df[(merged_df['worldwide_gross'] == 0) & (merged_df['foreign_gross'] != -99)]

Empty DataFrame
Columns: [release_date, title_x, production_budget, worldwide_gross, roi, net_revenue, year_x, title_year, title_y, studio, domestic_gross, foreign_gross, year_y]
Index: []

In [51]:
merged_df = merged_df.drop(['title_y', 'year_y'], axis = 1)
merged_df = merged_df.drop(['year_x', 'title_x'], axis = 1)

In [52]:
merged_df = merged_df.drop(['domestic_gross', 'foreign_gross'], axis = 1)

In [53]:
merged_df.head()

,release_date,production_budget,worldwide_gross,roi,net_revenue,title_year,studio
0,2015-07-10,100000,41656474,416.564740,41556474,The Gallows 2015,WB (NL)
1,2012-01-06,1000000,101759490,101.759490,100759490,The Devil Inside 2012,Par.
2,2011-04-01,1500000,99870886,66.580591,98370886,Insidious 2011,FD
3,2015-04-17,1000000,64364198,64.364198,63364198,Unfriended 2015,Uni.
4,2010-10-20,3000000,177512032,59.170677,174512032,Paranormal Activity 2 2010,Par.

In [54]:
merged_df = merged_df.sort_values(by = 'roi', ascending = False)

In [55]:
merged_df.shape

(1215, 7)

The dataset is much smaller after the inner join. The movies span release years from 2010 to 2018.

In [56]:
merged_df['release_date'].dt.year.value_counts()

2010    180
2011    161
2015    142
2012    141
2016    138
2013    137
2014    124
2017     99
2018     93
Name: release_date, dtype: int64

### Categorizing Studio Size

We segment studios into three categories: small, medium, and large. The categories are based on budget averaged across years 2010-2018. 
More info on studios in dataset here: https://www.boxofficemojo.com/studio/?view2=allstudios&view=company&p=.htm

In [57]:
merged_df['studio'].nunique()

96

We used the available data to estimate studio size based on their production budgets for the movies in our dataset.

In [58]:
size = merged_df.groupby(['studio'])['production_budget'].sum()

In [59]:
size = pd.DataFrame(size)

In [60]:
size.head()

        production_budget
studio
3D              5000000.0
A24           143100000.0
ATO            12500000.0
Affirm          7000000.0
Alc            10000000.0

In [61]:
#SIZE BUCKETS: length = 
# 12/11 = large, 10 = medium, 9/8 = small

In [62]:
size['production_budget'] = size['production_budget'].astype(str)

In [63]:
size['studio_size'] = size['production_budget'].map(lambda x: len(x))

In [64]:
size['studio_size'].replace([12, 11, 10, 9, 8], ["Large", "Large", "Medium", "Small", "Small"], inplace = True)

In [65]:
final_df = merged_df.merge(size, on = 'studio', how = 'inner')

In [66]:
final_df.drop(['production_budget_y', 'studio_size_x'], axis = 1, inplace = True)

KeyError: "['studio_size_x'] not found in axis"

In [ ]:
final_df['studio_size_y'].value_counts()

In [ ]:
final_df.head()

In [67]:
final_csv = final_df.to_csv('./data/final_df.csv')

# Questions - Future Steps 
 - More accurate data on production budgets / studio size

 - Genres
 - Production budget range 
 - Popularity (some kind of metric) / review ratings
 - Independent or major studio
     - Range of ROI
 - How do sequels perform in comparison to originals?
 - Season of release
 - Actors ? 
 - idea - create subset of 0s for second analysis on what not to do. (only if time!)

In [ ]:
movies['production_budget'].plot(kind = 'hist')

In [ ]:
movies['worldwide_gross'].plot(kind = 'hist')

In [ ]:
#can we fill in missing information using another dataset?

In [ ]:
df.shape

In [ ]:
df_budgets['worldwide_gross'] = df_budgets['worldwide_gross'].str.replace('$', '')
df_budgets['worldwide_gross'] = df_budgets['worldwide_gross'].str.replace(',','')

In [ ]:
df_budgets['domestic_gross'] = df_budgets['domestic_gross'].str.replace('$', '')
df_budgets['domestic_gross'] = df_budgets['domestic_gross'].str.replace(',','')

In [ ]:
df_budgets['production_budget'] = df_budgets['production_budget'].str.replace('$', '')
df_budgets['production_budget'] = df_budgets['production_budget'].str.replace(',','')

In [ ]:
df_budgets['worldwide_gross'].dtype(int)

In [ ]:
df_budgets.info()